ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0l211x_l112x/TIMG0_1.0.xml
        <register id="TIMG0_LOAD" width="32" offset="0x8" description="Load Register">
            <bitfield id="LD" description="Load Value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG0_CC_01" width="32" offset="0x10" instances="2" instaddr="0x4" description="Capture or Compare Register 0/1">
            <bitfield id="CCVAL" description="Capture or compare value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG0_CC_23" width="32" offset="0x18" instances="2" instaddr="0x4" description="Capture or Compare Register 2/3">
            <bitfield id="CCVAL" description="Capture or compare value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG0_CCCTL_01" width="32" offset="0x30" instances="2" instaddr="0x4" description="Capture or Compare Control Registers 0/1">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse." begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse." begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACT register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero event (CTR=0) or load event (CTR = LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACT_xy shadow register is loaded into CCACT_xy register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
        <register id="TIMG0_CCCTL_23" width="32" offset="0x38" instances="2" instaddr="0x4" description="Capture or Compare Control Registers 2/3">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse. 4h-Fh = Reserved" begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse. 6h-Fh = Reserved" begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse.  4h-Fh = Reserved" begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse. 4h-Fh = Reserved" begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACTx_y register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=cc_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero event (CTR=0) or load event (CTR=LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACTx_y shadow register is loaded into CCACTx_y active register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
